cf_billing/DataProcessors/бестМассовыйВводАктированногоРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестМассовыйВводАктированногоРасхода</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестТарифныеКатегорииНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТарифныеКатегорииНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТарифнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПоставщикиУслугНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПоставщикиУслугНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоставщикПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСпособНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСпособНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднееПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПриборам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуламРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасовоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаРозничномРынке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаПередачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоГрафикуГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтАктивнойЭнергии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныеОбъемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянныйРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/бестМассовыйВводАктированногоРасхода/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОбъемНачисленийТарифнаяЗона.Видимость 	= энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	Элементы.ОбъемНачисленийШкала.Видимость 		= энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
КонецПроцедуры

#КонецОбласти

#Область СобытияШапки

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ

&НаКлиенте
Процедура ОбъемНачисленийОбъемУслугиПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ОбъемНачисленийЗначениеТарифаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РучнойПерерасчетУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	
	ТекДанные = Элементы.ОбъемНачислений.ТекущиеДанные;
	
	ВыборУслугиИТочкиУчета(ТекДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура РучнойПерерасчетТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	
	ТекДанные = Элементы.ОбъемНачислений.ТекущиеДанные; 
	
	ВыборУслугиИТочкиУчета(ТекДанные); 
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета,ПростыеУслуги");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ЭтотОбъект);
	СтруктураОтбора.ОбъектРасчета 	= ТекДанные.ОбъектРасчета;
	СтруктураОтбора.Период 			= Период;
	СтруктураОтбора.ПростыеУслуги	= Истина;
	//СтруктураОтбора.Вставить("ТарифнаяЗона", 		?(ИспользоватьТарифныеЗоны, ТекДанные.ТарифнаяЗона, ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки")));
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца,ВыводитьСоставные", СтруктураОтбора, "НП",Ложь);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("СтруктураОтбора, ТекДанные", СтруктураОтбора, ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные		= ДополнительныеПараметры.ТекДанные;
		СтруктураОтбора	= ДополнительныеПараметры.СтруктураОтбора;
		СтруктураОтбора.Вставить("ТочкаУчета", 	РезультатЗакрытия.ТочкаУчета);
		СтруктураОтбора.Вставить("Услуга", 		РезультатЗакрытия.Услуга);
		
		СтруктураОтбора.Вставить("Поставщик", 	ТекДанные.Поставщик);
		СтруктураОтбора.Вставить("ТарифнаяЗона",ТекДанные.ТарифнаяЗона);
		
		ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора)  	
	
	ПараметрыСхемы		= Новый Структура;
	Схема 							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 		"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ОбъектРасчета", 	"ОбъектРасчета"), 		Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Услуга",	 		"Услуга"), 			Неопределено));		
	
	ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
	ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.бестТарифныеКатегорииНП.ТарифнаяКатегорияЮЛ(Схема,ПараметрыСхемы,"");
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	СтруктураОтбора.Организация);
	ПараметрыЗапроса.Вставить("Район", 			СтруктураОтбора.Район);
	ПараметрыЗапроса.Вставить("ОбъектРасчета", 	СтруктураОтбора.ОбъектРасчета);
	ПараметрыЗапроса.Вставить("Услуга", 		СтруктураОтбора.Услуга);
	ПараметрыЗапроса.Вставить("Период", 		СтруктураОтбора.Период);
	
	Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Выборка 						= Результат.Выбрать();
	
	СтруктураОтбора.Вставить("ТарифнаяГруппа", 	Справочники.энргГруппыПотребителей.ПустаяСсылка());
	СтруктураОтбора.Вставить("ЗначениеТарифа", 	0);
	СтруктураОтбора.Вставить("СтавкаНДС", 		0);
	СтруктураОтбора.Вставить("НДСВнутри", 		Ложь);
	СтруктураОтбора.Вставить("Договор", 		Справочники.энргДоговорыКонтрагентов.ПустаяСсылка());
	СтруктураОтбора.Вставить("ПриборУчета", 	Справочники.энргПриборыУчетаАбонента.ПустаяСсылка());
	
	
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.ТарифнаяГруппа = Выборка.ТарифнаяКатегория;
		
		ПараметрыСхемы		= Новый Структура;
		Схема 							= Неопределено;
		ПараметрыВТ 					= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 		"Организация"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ГруппаПотребителей","ГруппаПотребителей"), 		Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Услуга",	 		"Услуга"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Поставщик", 		"Поставщик"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ТарифнаяЗона",	 	"ТарифнаяЗона"), 			Неопределено));
		
		ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
		ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
		
		
		РегистрыСведений.энргЗначенияТарифов.ЗначенияТарифов(Схема,ПараметрыСхемы,"");
		ПараметрыЗапроса 				= Новый Структура;
		ПараметрыЗапроса.Вставить("Организация", 	СтруктураОтбора.Организация);
		ПараметрыЗапроса.Вставить("Район", 			СтруктураОтбора.Район);
		ПараметрыЗапроса.Вставить("ГруппаПотребителей", 		Выборка.ТарифнаяКатегория);
		Если НЕ ЗначениеЗаполнено(СтруктураОтбора.ТарифнаяЗона) Тогда
			СтруктураОтбора.ТарифнаяЗона = Справочники.энргТарифныеЗоны.БезРазбивки;
		КонецЕсли;
		ПараметрыЗапроса.Вставить("ТарифнаяЗона", 	СтруктураОтбора.ТарифнаяЗона);
		ПараметрыЗапроса.Вставить("Услуга", 		СтруктураОтбора.Услуга);
		ПараметрыЗапроса.Вставить("Поставщик", 		СтруктураОтбора.Поставщик);
		ПараметрыЗапроса.Вставить("Период", 		СтруктураОтбора.Период);
		
		Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
		Выборка 						= Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтруктураОтбора.ЗначениеТарифа 	= Выборка.Значение;
			СтруктураОтбора.СтавкаНДС 		= Выборка.СтавкаНДС;
			СтруктураОтбора.НДСВнутри 		= Выборка.НДСВнутри;
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ОбъектРасчета,СтруктураОтбора.ТочкаУчета,СтруктураОтбора.Услуга);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Договор = Выборка.Договор;
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестПоставщикиУслугНП.ПолучитьДанныеПоставщиков(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ТочкаУчета,СтруктураОтбора.Услуга);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Поставщик = Выборка.Поставщик;
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестПриборыТочекУчетаНП.ПолучитьДанныеПрибораУчета(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ОбъектРасчета,СтруктураОтбора.ТочкаУчета);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.ПриборУчета = Выборка.ПриборУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	ТекущиеДанные		= Элементы.ОбъемНачислений.ТекущиеДанные;
	
	ТекЗначениеТарифа 		= ТекущиеДанные.ЗначениеТарифа;
	ТекОбъемУслуги 			= ТекущиеДанные.ОбъемУслуги;
	ТекущиеДанные.ОбъемПотребленный =  ТекОбъемУслуги;
	
	ТекущиеДанные.Сумма 		= ТекОбъемУслуги * ТекЗначениеТарифа;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбъемНачислений.Очистить();
	РезультатОтбор = бестРаботаСТочкамиУчетаНПСервер.ПолучитьДействующиеТочкиУчета(Период,Организация,Район,Услуга,,ОбъектРасчета,,Договор,ЛС);
	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Период,Организация,Район,ОбъектРасчета,Истина,,МВТ,Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезультатОтбор.ТочкаУчета КАК ТочкаУчета,
	|	РезультатОтбор.Услуга КАК Услуга,
	|	РезультатОтбор.Договор КАК Договор,
	|	РезультатОтбор.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ВТ_Отборы
	|ИЗ
	|	&РезультатОтбор КАК РезультатОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ВидДифференцированности КАК ВидДифференцированности,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	ВТ_Отборы.Договор КАК Договор,
	|	ЕСТЬNULL(бестПоставщикиУслугНПСрезПоследних.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик
	|ПОМЕСТИТЬ ИтогПоставщики
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Отборы КАК ВТ_Отборы
	|		ПО Итог.ОбъектРасчета = ВТ_Отборы.ОбъектРасчета
	|			И Итог.ТочкаУчета = ВТ_Отборы.ТочкаУчета
	|			И Итог.Услуга = ВТ_Отборы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПоставщикиУслугНПСрезПоследних
	|		ПО Итог.ТочкаУчета = бестПоставщикиУслугНПСрезПоследних.ТочкаУчета
	|			И Итог.Услуга = бестПоставщикиУслугНПСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ГруппаПотребителей,
	|	ИтогПоставщики.ОбъектРасчета КАК ОбъектРасчета,
	|	ИтогПоставщики.ТочкаУчета КАК ТочкаУчета,
	|	ИтогПоставщики.Шкала КАК Шкала,
	|	ИтогПоставщики.Услуга КАК Услуга,
	|	ИтогПоставщики.ВидДифференцированности КАК ВидДифференцированности,
	|	ИтогПоставщики.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ИтогПоставщики.ПриборУчета КАК ПриборУчета,
	|	ИтогПоставщики.Договор КАК Договор,
	|	ИтогПоставщики.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ИтогТарифнаяКатегория
	|ИЗ
	|	ИтогПоставщики КАК ИтогПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТарифныеКатегорииНПСрезПоследних
	|		ПО ИтогПоставщики.ОбъектРасчета = бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета
	|			И ИтогПоставщики.Услуга = бестТарифныеКатегорииНПСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогТарифнаяКатегория.ГруппаПотребителей КАК ТарифнаяГруппа,
	|	ИтогТарифнаяКатегория.ОбъектРасчета КАК ОбъектРасчета,
	|	ИтогТарифнаяКатегория.ТочкаУчета КАК ТочкаУчета,
	|	ИтогТарифнаяКатегория.Шкала КАК Шкала,
	|	ИтогТарифнаяКатегория.Услуга КАК Услуга,
	|	ИтогТарифнаяКатегория.ВидДифференцированности КАК ВидДифференцированности,
	|	ИтогТарифнаяКатегория.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ИтогТарифнаяКатегория.ПриборУчета КАК ПриборУчета,
	|	ИтогТарифнаяКатегория.Договор КАК Договор,
	|	ИтогТарифнаяКатегория.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ИЗ
	|	ИтогТарифнаяКатегория КАК ИтогТарифнаяКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|		ПО ИтогТарифнаяКатегория.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И ИтогТарифнаяКатегория.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И ИтогТарифнаяКатегория.Поставщик = энргЗначенияТарифовСрезПоследних.Поставщик
	|			И ИтогТарифнаяКатегория.ТарифнаяЗона = энргЗначенияТарифовСрезПоследних.ТарифнаяЗона";
	
	Запрос.УстановитьПараметр("РезультатОтбор", РезультатОтбор);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);

	Если НЕ энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИтогТарифнаяКатегория.ТарифнаяЗона = энргЗначенияТарифовСрезПоследних.ТарифнаяЗона", "Истина");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ОбъемНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.РасчетныйПериод = ПериодНачисления;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъемНачислений.РасчетныйПериод КАК РасчетныйПериод,
	|	ОбъемНачислений.ОбъектРасчета КАК ОбъектРасчета,
	|	ОбъемНачислений.Поставщик КАК Поставщик,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	ОбъемНачислений.Договор КАК Договор,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	ОбъемНачислений.ОбъемПотребленный КАК ОбъемПотребленный,
	|	ОбъемНачислений.Сумма КАК Сумма,
	|	ОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа
	|ПОМЕСТИТЬ ВТ_Объемы
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объемы.РасчетныйПериод КАК ПериодНачисления,
	|	ВТ_Объемы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Объемы.Поставщик КАК Поставщик,
	|	ВТ_Объемы.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Объемы.Услуга КАК Услуга,
	|	ВТ_Объемы.Договор КАК Договор,
	|	ВТ_Объемы.ПриборУчета КАК ПриборУчета,
	|	ВТ_Объемы.Шкала КАК Шкала,
	|	ВТ_Объемы.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Объемы.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_Объемы.ОбъемПотребленный КАК ОбъемУслугиПотребленный,
	|	ВТ_Объемы.Сумма КАК Сумма,
	|	ВТ_Объемы.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВТ_Объемы.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестОбъектыРасчета.МКД КАК МКД,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.РасходПоАкту) КАК СпособНачисления
	|ИЗ
	|	ВТ_Объемы КАК ВТ_Объемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ВТ_Объемы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ИТОГИ ПО
	|	МКД";
	
	Запрос.УстановитьПараметр("ОбъемНачислений", ОбъемНачислений.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМКД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМКД.Следующий() Цикл
		ДокументСсылка 										= Документы.бестПерерасчетНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ПерерасчетОб 					= Документы.бестПерерасчетНП.СоздатьДокумент();
		ПерерасчетОб.Дата 				= Период;
		ПерерасчетОб.ВидОперации 		= Перечисления.бестВидыОпераций.Перерасчет_РучнойПерерасчет;
		ПерерасчетОб.Организация 		= Организация;
		ПерерасчетОб.Район 				= Район;
		ПерерасчетОб.ПериодНачисления   = ПериодНачисления;
		ПерерасчетОб.Примечание 		= "Создан обработкой ""Массовый ввод актированного расхода""";
		ПерерасчетОб.УстановитьСсылкуНового(ДокументСсылка);
		
		Набор 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка);
		
		ВыборкаДетальныеЗаписи = ВыборкаМКД.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);	
			НоваяЗапись.Период 			= Период;
			НоваяЗапись.Активность 		= Истина;
			НоваяЗапись.ПериодРасчета 	= ПериодНачисления;	
			НоваяЗапись.ПериодНачисления= ПериодНачисления;
			НоваяЗапись.Район			= ПерерасчетОб.Район;
			НоваяЗапись.Организация 	= ПерерасчетОб.Организация;
			НоваяЗапись.ВидНачисления 	= Перечисления.энргВидыНачислений.Начисление;
			НоваяЗапись.НачалоПериода   = НачалоМесяца(ПерерасчетОб.ПериодНачисления);
			НоваяЗапись.КонецПериода    = КонецМесяца(ПерерасчетОб.ПериодНачисления);
		КонецЦикла;
		Набор.Записать();
		ПерерасчетОб.Записать();
		СозданныеДокументы.Добавить(ПерерасчетОб.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПериодНачисления()
	ПериодНачисления 	= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Период, Организация,Район);
КонецПроцедуры

#КонецОбласти
